### 📖 Terraform Plan (infra/resources//dev) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_role_assignment.infra_cd_key_vault_crypto will be created
  + resource "azurerm_role_assignment" "infra_cd_key_vault_crypto" {
      + condition_version                = (known after apply)
      + description                      = "Allow Infra CD Identity to manage KeyVault keys operations. Used by Terraform integration tests on ephemeral KeyVaults."
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a40fdbdf-8021-465b-83ea-48482cbd0fd4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Officer"
      + scope                            = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.testing.azurerm_subnet_network_security_group_association.common_runner_to_tests_pep["/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-apim-snet-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "common_runner_to_tests_pep" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/networkSecurityGroups/dx-d-itn-common-vnet-nsg-01"
      + subnet_id                 = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-apim-snet-01"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Reference to undefined provider

  on tests.tf line 5, in module "testing":
   5:     dx = azuredx

There is no explicit declaration for local provider name "azuredx" in the
root module, so Terraform is assuming you mean to pass a configuration for
provider "hashicorp/azuredx".

To clarify your intent and silence this warning, add to the root module a
required_providers entry named "azuredx" with source = "hashicorp/azuredx",
or a different source address if appropriate.
```

</details>
